src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://ixcorp.com.pe/biblioteca-soap/users">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>Jedion</us:name>
        </us:getUserRequest>
        <us:getAllUserRequest/>
    </soapenv:Body>
</soapenv:Envelope>